#input str
#veriable เป็น identifier หน้าที่เก็บชข้อมูล
#identifier คือ ชื่อที่คนเขียนตั้งไว้ หรือ กล่องเก็บข้อความ

std_id = input ("กรุณาใส่รหัสนศ. : ")
std_name = input ("กรุณาใส่ชื่อนศ. : ")
std_year = int(input ("กรุณาใส่ปีเกิด. : "))
std_age = int(2023 - std_year)
print ("--------------------------------------------")
print (f"ยินดีต้อนรับ : {std_id} ชื่อ : {std_name} ")
print (f"ปีเกิดของคุณ : {std_year} อายุของคุณ : {std_age}")
print ("--------------------------------------------")
print ("ยินดีต้อนรับ :",std_id , "ชื่อ :",std_name)
print ("ปีเกิดของคุณ :",std_year , "อายุของคุณ :",std_age)
print ("--------------------------------------------")
print ("ยินดีต้อนรับ : " + std_id + " ชื่อ : " + std_name)
print ("ปีเกิดของคุณ : " + str(std_year) + " อายุของคุณ : " + str(std_age))
print ("--------------------------------------------")
print ("ยินดีต้อนรับ : {0} ชื่อ : {1}".format(std_id,std_name))
print ("ปีเกิดของคุณ : {0} อายุของคุณ : {1}".format(std_year,std_age))
print ("--------------------------------------------")
print ("ยินดีต้อนรับ : %s ชื่อ : %s"%(std_id,std_name))
print ("ปีเกิดของคุณ : %s อายุของคุณ : %s"%(std_year,std_age))
print ("--------------------------------------------")